# Классическая игра в крестики-нолики на игровом поле 3х3

print("Игра в крестики - нолики. \n"
      "Первым ходят крестики. \n")


def chis(x):
    x1 = int(x)-1
    X = [i for i in range(9)]
    if x1 in X:
        return x1
    else:
        print('Введите чесло от 1 до 9')


p = input('Введите номер ячейки: ')

P = {i: ' ' for i in range(9)}
P[chis(p)] = "X"

pole = (f'   +---+---+---+\n'
        f'   | {P[0]}¹| {P[1]}²| {P[2]}³|\n'
        f'   +---+---+---+\n'
        f'   | {P[3]}⁴| {P[4]}⁵| {P[5]}⁶|\n'
        f'   +---+---+---+\n'
        f'   | {P[6]}⁷| {P[7]}⁸| {P[8]}⁹|\n'
        f'   +---+---+---+\n'
        f'              '
        )
print(pole)
print(P)

