# Классическая игра в крестики-нолики на игровом поле 3х3

print("Игра в крестики - нолики. \n"
      "Первым ходят крестики. \n")


def chis(p):  # Проверка на число
    X = [i for i in range(1, 10)]
    if p.isdigit():
        if int(p) in X:
            return int(p)
        else:
            print('Введите число от 1 до 9')
            return pole()
    else:
        print('Введите число от 1 до 9')
        return pole()


def hod(x): # Проверка на занятость ячейки
    global P
    if P[x] == ' ':
        print(x)
        return x
    else:
        print("Ячейка занята, попробуйте снова!")
        return pole()


def pole():  # ход игрока
    p = input('Введите номер ячейки: ')
    return hod(chis(p))


def game(P):  # Ход игры
    print(f'   +---+---+---+\n'
          f'   | {P[1]}¹| {P[2]}²| {P[3]}³|\n'
          f'   +---+---+---+\n'
          f'   | {P[4]}⁴| {P[5]}⁵| {P[6]}⁶|\n'
          f'   +---+---+---+\n'
          f'   | {P[7]}⁷| {P[8]}⁸| {P[9]}⁹|\n'
          f'   +---+---+---+\n'
          f' ')
    P[pole()] = "X"
    print(f'   +---+---+---+\n'
          f'   | {P[1]}¹| {P[2]}²| {P[3]}³|\n'
          f'   +---+---+---+\n'
          f'   | {P[4]}⁴| {P[5]}⁵| {P[6]}⁶|\n'
          f'   +---+---+---+\n'
          f'   | {P[7]}⁷| {P[8]}⁸| {P[9]}⁹|\n'
          f'   +---+---+---+\n'
          f' ')
    for i in range(4):
        P[pole()] = "0"
        print(f'   +---+---+---+\n'
              f'   | {P[1]}¹| {P[2]}²| {P[3]}³|\n'
              f'   +---+---+---+\n'
              f'   | {P[4]}⁴| {P[5]}⁵| {P[6]}⁶|\n'
              f'   +---+---+---+\n'
              f'   | {P[7]}⁷| {P[8]}⁸| {P[9]}⁹|\n'
              f'   +---+---+---+\n'
              f' ')
        P[pole()] = "X"
        print(f'   +---+---+---+\n'
              f'   | {P[1]}¹| {P[2]}²| {P[3]}³|\n'
              f'   +---+---+---+\n'
              f'   | {P[4]}⁴| {P[5]}⁵| {P[6]}⁶|\n'
              f'   +---+---+---+\n'
              f'   | {P[7]}⁷| {P[8]}⁸| {P[9]}⁹|\n'
              f'   +---+---+---+\n'
              f' ')



P = {i: ' ' for i in range(1, 10)}

game(P)


